![Two data scientists working on a dashboard.](hr-image-small.png)

A common problem when creating models to generate business value from data is that the datasets can be so large that it can take days for the model to generate predictions. Ensuring that your dataset is stored as efficiently as possible is crucial for allowing these models to run on a more reasonable timescale without having to reduce the size of the dataset.

You've been hired by a major online data science training provider called *Training Data Ltd.* to clean up one of their largest customer datasets. This dataset will eventually be used to predict whether their students are looking for a new job or not, information that they will then use to direct them to prospective recruiters.

You've been given access to `customer_train.csv`, which is a subset of their entire customer dataset, so you can create a proof-of-concept of a much more efficient storage solution. The dataset contains anonymized student information, and whether they were looking for a new job or not during training:

| Column                   | Description                                                                      |
|------------------------- |--------------------------------------------------------------------------------- |
| `student_id`             | A unique ID for each student.                                                    |
| `city`                   | A code for the city the student lives in.                                        |
| `city_development_index` | A scaled development index for the city.                                         |
| `gender`                 | The student's gender.                                                            |
| `relevant_experience`    | An indicator of the student's work relevant experience.                          |
| `enrolled_university`    | The type of university course enrolled in (if any).                              |
| `education_level`        | The student's education level.                                                   |
| `major_discipline`       | The educational discipline of the student.                                       |
| `experience`             | The student's total work experience (in years).                                  |
| `company_size`           | The number of employees at the student's current employer.                       |
| `company_type`           | The type of company employing the student.                                       |
| `last_new_job`           | The number of years between the student's current and previous jobs.             |
| `training_hours`         | The number of hours of training completed.                                       |
| `job_change`             | An indicator of whether the student is looking for a new job (`1`) or not (`0`). |

In [1]:
# Import necessary libraries
import pandas as pd

# Load the dataset
ds_jobs = pd.read_csv("customer_train.csv")

# View the dataset
ds_jobs.head()

,student_id,city,city_development_index,gender,relevant_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,job_change
0,8949,city_103,0.920,Male,Has relevant experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0
1,29725,city_40,0.776,Male,No relevant experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0
2,11561,city_21,0.624,NaN,No relevant experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0.0
3,33241,city_115,0.789,NaN,No relevant experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0
4,666,city_162,0.767,Male,Has relevant experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0

In [2]:
# Create a copy of ds_jobs for transforming
ds_jobs_transformed = ds_jobs.copy()

# Start coding here. Use as many cells as you like!

### The Head Data Scientist at Training Data Ltd. has asked you to create a DataFrame called ds_jobs_transformed that stores the data in customer_train.csv much more efficiently. Specifically, they have set the following requirements:

**Q1. Columns containing categories with only two factors must be stored as Booleans (bool).**

In [3]:
# preview the data
print(ds_jobs_transformed.dtypes)
ds_jobs_transformed.head()

student_id                  int64
city                       object
city_development_index    float64
gender                     object
relevant_experience        object
enrolled_university        object
education_level            object
major_discipline           object
experience                 object
company_size               object
company_type               object
last_new_job               object
training_hours              int64
job_change                float64
dtype: object

,student_id,city,city_development_index,gender,relevant_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,job_change
0,8949,city_103,0.920,Male,Has relevant experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0
1,29725,city_40,0.776,Male,No relevant experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0
2,11561,city_21,0.624,NaN,No relevant experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0.0
3,33241,city_115,0.789,NaN,No relevant experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0
4,666,city_162,0.767,Male,Has relevant experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0

In [4]:
# check for columns with only 2 unique values
bool_cols = []

for col in ds_jobs_transformed.columns:
    if ds_jobs_transformed[col].nunique() == 2:
        bool_cols.append(col)
        
print(f'The column/s with only 2 factors is/are {bool_cols}')

The column/s with only 2 factors is/are ['relevant_experience', 'job_change']

In [5]:
# change the dtypes
for col in bool_cols:
    ds_jobs_transformed[col] = ds_jobs_transformed[col].astype('bool')
    
print(ds_jobs_transformed.dtypes)

student_id                  int64
city                       object
city_development_index    float64
gender                     object
relevant_experience          bool
enrolled_university        object
education_level            object
major_discipline           object
experience                 object
company_size               object
company_type               object
last_new_job               object
training_hours              int64
job_change                   bool
dtype: object

**Q2. Columns containing integers only must be stored as 32-bit integers (int32).**

In [6]:
# find the integer columns
int_cols = ds_jobs_transformed.select_dtypes(include = 'int').columns

print(f'The column/s with dtype int64 is/are {list(int_cols)}')

The column/s with dtype int64 is/are ['student_id', 'training_hours']

In [7]:
# change dtype to int32
for col in int_cols:
    ds_jobs_transformed[col] = ds_jobs_transformed[col].astype('int32')
    
print(ds_jobs_transformed.dtypes)

student_id                  int32
city                       object
city_development_index    float64
gender                     object
relevant_experience          bool
enrolled_university        object
education_level            object
major_discipline           object
experience                 object
company_size               object
company_type               object
last_new_job               object
training_hours              int32
job_change                   bool
dtype: object

**Q3. Columns containing floats must be stored as 16-bit floats (float16).**

In [8]:
# check for float columns
float_cols = ds_jobs_transformed.select_dtypes(include = 'float').columns

print(f'The column/s with the float data type is/are {list(float_cols)}')

The column/s with the float data type is/are ['city_development_index']

In [9]:
# change the dtypes
for col in float_cols:
    ds_jobs_transformed[col] = ds_jobs_transformed[col].astype('float16')
    
print(ds_jobs_transformed.dtypes)

student_id                  int32
city                       object
city_development_index    float16
gender                     object
relevant_experience          bool
enrolled_university        object
education_level            object
major_discipline           object
experience                 object
company_size               object
company_type               object
last_new_job               object
training_hours              int32
job_change                   bool
dtype: object

**Q4. Columns containing nominal categorical data must be stored as the category data type.**

In [10]:
# find all object columns
cat_df = ds_jobs_transformed.select_dtypes(include = 'object')

cat_df.head()

,city,gender,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job
0,city_103,Male,no_enrollment,Graduate,STEM,>20,NaN,NaN,1
1,city_40,Male,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4
2,city_21,NaN,Full time course,Graduate,STEM,5,NaN,NaN,never
3,city_115,NaN,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never
4,city_162,Male,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4

In [11]:
# ascertain possible nominal columns
nominals = ['city', 'gender','major_discipline', 'company_type']

# change them to category data type
for col in nominals:
    ds_jobs_transformed[col] = ds_jobs_transformed[col].astype('category')
    
print(ds_jobs_transformed.dtypes)

student_id                   int32
city                      category
city_development_index     float16
gender                    category
relevant_experience           bool
enrolled_university         object
education_level             object
major_discipline          category
experience                  object
company_size                object
company_type              category
last_new_job                object
training_hours               int32
job_change                    bool
dtype: object

**Q5. Columns containing ordinal categorical data must be stored as ordered categories, and not mapped to numerical values, with an order that reflects the natural order of the column.**

In [12]:
# Ascertain ordinal columns
ordinals = ['enrolled_university', 'education_level', 'experience', 'company_size', 'last_new_job']

# set them to ordered categories
for col in ordinals:
    ds_jobs_transformed[col] = ds_jobs_transformed[col].astype('category')

In [13]:
print(list(ds_jobs_transformed['enrolled_university'].unique()))

['no_enrollment', 'Full time course', nan, 'Part time course']

In [14]:
# write them in  order and order categories
education_cat = ['Primary School', 'High School', 'Graduate', 'Masters', 'Phd']
experience_cat = ['<1', '1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '>20']
compsize_cat = ['<10', '10-49', '50-99', '100-499', '500-999', '1000-4999', '5000-9999', '10000+']
last_job_cat = ['never', '1', '2', '3', '4', '>4']

# order them
ds_jobs_transformed['education_level'].cat.reorder_categories(new_categories = education_cat, inplace = True, ordered = True)
ds_jobs_transformed['experience'].cat.reorder_categories(new_categories = experience_cat, inplace = True, ordered = True)
ds_jobs_transformed['company_size'].cat.reorder_categories(new_categories = compsize_cat, inplace = True, ordered = True)
ds_jobs_transformed['last_new_job'].cat.reorder_categories(new_categories = last_job_cat, inplace = True, ordered = True)
ds_jobs_transformed['enrolled_university'].cat.reorder_categories(new_categories = ['no_enrollment', 'Part time course', 'Full time course'], ordered = True, inplace = True)

TypeError: Categorical.reorder_categories() got an unexpected keyword argument 'inplace'

In [16]:
# check
ds_jobs_transformed['enrolled_university'].unique()

['no_enrollment', 'Full time course', NaN, 'Part time course']
Categories (3, object): ['Full time course', 'Part time course', 'no_enrollment']

In [15]:
# see dtypes
ds_jobs_transformed.dtypes

student_id                   int32
city                      category
city_development_index     float16
gender                    category
relevant_experience           bool
enrolled_university       category
education_level           category
major_discipline          category
experience                category
company_size              category
company_type              category
last_new_job              category
training_hours               int32
job_change                    bool
dtype: object

**Q6. The DataFrame should be filtered to only contain students with 10 or more years of experience at companies with at least 1000 employees, as their recruiter base is suited to more experienced professionals at enterprise companies.**

In [17]:
# Filter for experience 10 or more years
# and company size 1000 or more
ds_jobs_transformed = ds_jobs_transformed[(ds_jobs_transformed['experience'].isin(['10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '>20'])) & (ds_jobs_transformed['company_size'].isin(['1000-4999', '5000-9999', '10000+']))]

ds_jobs_transformed.head()

,student_id,city,city_development_index,gender,relevant_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,job_change
9,699,city_103,0.919922,NaN,True,no_enrollment,Graduate,STEM,17,10000+,Pvt Ltd,>4,123,False
12,25619,city_61,0.913086,Male,True,no_enrollment,Graduate,STEM,>20,1000-4999,Pvt Ltd,3,23,False
31,22293,city_103,0.919922,Male,True,Part time course,Graduate,STEM,19,5000-9999,Pvt Ltd,>4,141,False
34,26494,city_16,0.910156,Male,True,no_enrollment,Graduate,Business Degree,12,5000-9999,Pvt Ltd,3,145,False
40,2547,city_114,0.925781,Female,True,Full time course,Masters,STEM,16,1000-4999,Public Sector,2,14,False

In [18]:
# check the infos
print(ds_jobs.info(), ds_jobs_transformed.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19158 entries, 0 to 19157
Data columns (total 14 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   student_id              19158 non-null  int64
 1   city                    19158 non-null  object
 2   city_development_index  19158 non-null  float64
 3   gender                  14650 non-null  object
 4   relevant_experience     19158 non-null  object
 5   enrolled_university     18772 non-null  object
 6   education_level         18698 non-null  object
 7   major_discipline        16345 non-null  object
 8   experience              19093 non-null  object
 9   company_size            13220 non-null  object
 10  company_type            13018 non-null  object
 11  last_new_job            18735 non-null  object
 12  training_hours          19158 non-null  int64
 13  job_change              19158 non-null  float64
dtypes: float64(2), int64(2), object(10)
memory usage: 2.0+ MB
<class 'pandas.core.frame.DataFrame'>
Index: 2201 entries, 9 to 19143
Data columns (total 14 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   student_id              2201 non-null   int32
 1   city                    2201 non-null   category
 2   city_development_index  2201 non-null   float16
 3   gender                  1821 non-null   category
 4   relevant_experience     2201 non-null   bool
 5   enrolled_university     2185 non-null   category
 6   education_level         2184 non-null   category
 7   major_discipline        2097 non-null   category
 8   experience              2201 non-null   category
 9   company_size            2201 non-null   category
 10  company_type            2144 non-null   category
 11  last_new_job            2184 non-null   category
 12  training_hours          2201 non-null   int32
 13  job_change              2201 non-null   bool
dtypes: bool(2), category(9), float16(1), int32(2)
memory usage: 69.5 KB
None None

In [19]:
# check memory usage
print(ds_jobs.memory_usage(), ds_jobs_transformed.memory_usage())

Index                        132
student_id                153264
city                      153264
city_development_index    153264
gender                    153264
relevant_experience       153264
enrolled_university       153264
education_level           153264
major_discipline          153264
experience                153264
company_size              153264
company_type              153264
last_new_job              153264
training_hours            153264
job_change                153264
dtype: int64 Index                     17608
student_id                 8804
city                       7353
city_development_index     4402
gender                     2333
relevant_experience        2201
enrolled_university        2333
education_level            2413
major_discipline           2421
experience                 2933
company_size               2565
company_type               2421
last_new_job               2421
training_hours             8804
job_change                 2201
dtype: int64